#### Terraform Format and Style 🤖🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 👨‍💻`success`
<details><summary>Validation Output</summary>
```

{
  "format_version": "1.0",
  "valid": true,
  "error_count": 0,
  "warning_count": 1,
  "diagnostics": [
    {
      "severity": "warning",
      "summary": "Reference to undefined provider",
      "detail": "There is no explicit declaration for local provider name "google" in module.gar, so Terraform is assuming you mean to pass a configuration for "hashicorp/google".

If you also control the child module, add a required_providers entry named "google" with the source address "hashicorp/google".",
      "range": {
        "filename": "entrypoint.tf",
        "start": {
          "line": 4,
          "column": 5,
          "byte": 62
        },
        "end": {
          "line": 4,
          "column": 11,
          "byte": 68
        }
      },
      "snippet": {
        "context": "module "gar"",
        "code": "    google = google.non-prod",
        "start_line": 4,
        "highlight_start_offset": 4,
        "highlight_end_offset": 10,
        "values": []
      }
    }
  ]
}

```
</details>
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.gar.google_artifact_registry_repository.gar["repo1"] will be created
  + resource "google_artifact_registry_repository" "gar" {
      + create_time      = (known after apply)
      + description      = "Google Artifact Registry Repository"
      + effective_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + format           = "docker"
      + id               = (known after apply)
      + location         = "asia-south1"
      + mode             = "STANDARD_REPOSITORY"
      + name             = (known after apply)
      + project          = "bitlost"
      + repository_id    = "repository1"
      + terraform_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + update_time      = (known after apply)

      + vulnerability_scanning_config (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Warning: Reference to undefined provider

  on entrypoint.tf line 4, in module "gar":
   4:     google = google.non-prod

There is no explicit declaration for local provider name "google" in
module.gar, so Terraform is assuming you mean to pass a configuration for
"hashicorp/google".

If you also control the child module, add a required_providers entry named
"google" with the source address "hashicorp/google".

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @iamgp21, Action: `pull_request`*